---
type: AnalysisDisplayDiagramSettings
namespace: Autodesk.Revit.DB.Analysis
version: 2024
members: 12
tags: [revit-api, class]
---

# AnalysisDisplayDiagramSettings

`Autodesk.Revit.DB.Analysis.AnalysisDisplayDiagramSettings` · Revit 2024 · 12 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | AnalysisDisplayDiagramSettings | — | `` |
| Constructor | AnalysisDisplayDiagramSettings | 2012 | `public AnalysisDisplayDiagramSettings ()` |
| Method | Dispose | — | `public void Dispose ()` |
| Method | IsEqual | 2012 | `public bool IsEqual ( AnalysisDisplayDiagramSettings other )` |
| Property | FenceType | 2012 | `public AnalysisDisplayStyleDiagramFenceType FenceType { get ; set ; }` |
| Property | IsValidObject | 2014 | `public bool IsValidObject { get ; }` |
| Property | OutlineColor | 2012 | `public Color OutlineColor { get ; set ; }` |
| Property | OutlineLineWeight | 2012 | `public int OutlineLineWeight { get ; set ; }` |
| Property | Rounding | 2012 | `public double Rounding { get ; set ; }` |
| Property | TextLabelType | 2012 | `public AnalysisDisplayStyleDiagramTextLabelType TextLabelType { get ; set ; }` |
| Property | TextTypeId | 2012 | `public ElementId TextTypeId { get ; set ; }` |
| Property | Transparency | 2012 | `public int Transparency { get ; set ; }` |